Revit 2027 API
ElementId.Value Property
 Provides the value of the element id as a 64-bit integer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public long Value { get; }
Public ReadOnly Property Value As Long
	Get
public:
property long long Value {
	long long get ();
}
member Value : int64 with get
Property Value
Int64
See Also
Reference
ElementId Class
Autodesk.Revit.DB Namespace